<Qucs Schematic 0.0.19>
<Properties>
  <View=-50,-242,1778,1026,0.751315,0,0>
  <Grid=10,10,1>
  <DataSet=8.dat>
  <DataDisplay=8.dpl>
  <OpenDisplay=1>
  <Script=8.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Title>
  <FrameText1=Drawn By:>
  <FrameText2=Date:>
  <FrameText3=Revision:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <.AC AC1 1 0 130 0 41 0 0 "log" 1 "1 Hz" 1 "10 GHz" 1 "70" 1 "no" 0>
  <.DC DC1 1 0 60 0 41 0 0 "26.85" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "no" 0 "150" 0 "no" 0 "none" 0 "CroutLU" 0>
  <Lib OP1 1 580 330 -20 64 0 0 "OpAmps" 0 "ua741(mod)" 0>
  <Vdc V1 1 620 430 18 -26 1 3 "15 V" 1>
  <GND * 1 330 510 0 0 0 0>
  <GND * 1 510 510 0 0 0 0>
  <GND * 1 620 510 0 0 0 0>
  <Vac V3 1 330 450 18 -26 0 1 "1 V" 1 "1 GHz" 0 "0" 0 "0" 0>
  <C C2 1 410 370 -26 17 0 0 "C2" 1 "" 0 "neutral" 0>
  <Vdc V2 1 620 230 -64 -26 0 3 "10 V" 1>
  <GND * 1 700 220 0 0 0 0>
  <R R1 1 510 450 15 -26 0 1 "1 k" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <C C3 1 950 410 17 -26 0 1 "1 pF" 1 "" 0 "neutral" 0>
  <GND * 1 950 510 0 0 0 0>
  <R R2 1 830 330 -26 15 0 0 "1 kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <Eqn Eqn1 1 40 310 -34 16 0 0 "fd=10 k" 1 "R2=10 M" 1 "R1=10 k" 1 "fg=10 M" 1 "tau_d=1/(2*pi*fd)" 1 "tau_g=1/(2*pi*fg)" 1 "C2=tau_d/R1" 1 "C3=tau_g/R2" 1 "K=dB(Vout1.v/Vin.v)" 1 "phase=phase(Vout1.v/Vin.v)" 1 "phase_rad=deg2rad(phase)" 1 "yes" 0>
</Components>
<Wires>
  <620 370 620 400 "" 0 0 0 "">
  <670 330 770 330 "" 0 0 0 "">
  <620 460 620 510 "" 0 0 0 "">
  <330 480 330 510 "" 0 0 0 "">
  <330 370 330 420 "" 0 0 0 "">
  <330 370 380 370 "" 0 0 0 "">
  <440 370 510 370 "" 0 0 0 "">
  <510 370 540 370 "" 0 0 0 "">
  <510 370 510 420 "" 0 0 0 "">
  <510 480 510 510 "" 0 0 0 "">
  <620 260 620 290 "" 0 0 0 "">
  <700 200 700 220 "" 0 0 0 "">
  <620 200 700 200 "" 0 0 0 "">
  <540 160 540 290 "" 0 0 0 "">
  <540 160 770 160 "" 0 0 0 "">
  <770 330 800 330 "" 0 0 0 "">
  <770 160 770 330 "" 0 0 0 "">
  <950 330 950 380 "" 0 0 0 "">
  <860 330 950 330 "" 0 0 0 "">
  <950 440 950 510 "" 0 0 0 "">
  <330 370 330 370 "Vin" 360 340 0 "">
  <950 330 950 330 "Vout1" 980 300 0 "">
</Wires>
<Diagrams>
  <Rect 1073 329 648 389 3 #c0c0c0 1 10 1 1 1 1e+10 1 -109.962 20 9.58414 1 -1 0.5 1 315 0 225 "częstotliwość [Hz]" "wzmocnienie [dB]" "">
	<"K" #0000ff 0 3 0 0 0>
  </Rect>
  <Rect 1079 770 651 390 3 #c0c0c0 1 10 1 0 2e+09 1e+10 1 -200 200 200 1 -4 2 2.54864 315 0 225 "częstotliwość [Hz]" "faza [deg]" "faza [rad]">
	<"phase" #0000ff 0 3 0 0 0>
	<"phase_rad" #ff0000 0 3 0 0 1>
  </Rect>
</Diagrams>
<Paintings>
</Paintings>
